OpenFOAM files/run/onlyOneTree/LAD5e10/LoD3/broadleaf_ex/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    x0
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          481;
        startFace       24593;
    }
    y0
    {
        type            patch;
        nFaces          234;
        startFace       25074;
    }
    x1
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          481;
        startFace       25308;
    }
    y1
    {
        type            patch;
        nFaces          234;
        startFace       25789;
    }
    terrain
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          666;
        startFace       26023;
    }
    sky
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          666;
        startFace       26689;
    }
)

// ************************************************************************* //
